In [ ]:
import numpy as np
import pandas as pd

In [6]:
s = pd.Series([1,2,3,4])
type(s)
s1 = pd.Series([1,2,3,4],index = ['A','B','C','D'])

In [6]:
s1

A    1
B    2
C    3
D    4
dtype: int64

In [ ]:
data =[[1,444,'abc'],
       [2,555,'abc'],
       [3,666,'abc'],
       [4,333,'abc']]

data_2={'ID':[1,2,3,4],
        'std_id_dict':[444,555,666,777],
        'dept':['abc','def','ghj','jjj']}
df = pd.DataFrame(data,columns=['ID','std_id','Dept'])
df2= pd.DataFrame(data_2)
print(df)
print(df2)

   ID  std_id Dept
0   1     444  abc
1   2     555  abe
2   3     666  rbc
3   4     333  hbc
   ID  std_id_dict dept
0   1          444  abc
1   2          555  def
2   3          666  ghj
3   4          777  jjj

In [5]:
df.columns

Index(['ID', 'std_id', 'Dept'], dtype='str')

In [32]:
index = ['row1','row2','row3','row4']
df.index =index
display(df)

# dtype o,s,f,i,b

      ID  std_id Dept
row1   1     444  abc
row2   2     555  abe
row3   3     666  rbc
row4   4     333  hbc

In [8]:
class person:
   def __init__(self,name):
      self.name = name 
   @property
   def getinfo(self):
      return f"my name is {self.name}"   
   

p1 =person('mariam')   
p1.getinfo

'my name is mariam'

In [9]:
df.dtypes

ID        int64
std_id    int64
Dept        str
dtype: object

In [10]:
df['Dept'].dtype

In [11]:
df['Dept'] = df['Dept'].astype('category')
df['Dept'].dtype

CategoricalDtype(categories=['abc'], ordered=False, categories_dtype=str)

In [12]:
df.dtypes

ID           int64
std_id       int64
Dept      category
dtype: object

In [13]:
df.head(1)
df.tail(2)

      ID  std_id Dept
row3   3     666  abc
row4   4     333  abc

In [19]:
df.describe()
#df.describe(include= 'category')

             ID      std_id
count  4.000000    4.000000
mean   2.500000  499.500000
std    1.290994  143.300384
min    1.000000  333.000000
25%    1.750000  416.250000
50%    2.500000  499.500000
75%    3.250000  582.750000
max    4.000000  666.000000

In [20]:
df.columns

Index(['ID', 'std_id', 'Dept'], dtype='str')

In [ ]:
x=df['std_id'].unique().sum()

x

np.int64(1998)

In [34]:
df['std_id'].max()
df['std_id'].min()

np.int64(333)

In [33]:
df.Dept.idxmax()
df.Dept.idxmin()

'row1'

In [35]:
df.info()

<class 'pandas.DataFrame'>
Index: 4 entries, row1 to row4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      4 non-null      int64
 1   std_id  4 non-null      int64
 2   Dept    4 non-null      str
dtypes: int64(2), str(1)
memory usage: 128.0+ bytes

In [36]:
df['Dept'].value_counts()

Dept
abc    1
abe    1
rbc    1
hbc    1
Name: count, dtype: int64

In [ ]:
df['ID'].sum()

np.int64(10)

In [39]:
def duplicate(x):
   return x*2

df['std_id'].apply(duplicate)
df['std_id'].apply(lambda x:x*2)

row1     888
row2    1110
row3    1332
row4     666
Name: std_id, dtype: int64

In [ ]:
#indexing // slices locate specefic value

df['std_id'].iloc[1]

df.iloc[2,1]

np.int64(666)

In [48]:
df.Dept.iloc[0:2]

row1    abc
row2    abe
Name: Dept, dtype: str

In [ ]:
#row   [:   ,  //col  0:2]
df.iloc[:,0:2]

      ID  std_id
row1   1     444
row2   2     555
row3   3     666
row4   4     333

In [57]:
cat_col = df.iloc[:,2:3]
cat_col = df.iloc[:,:-1]
target_y = df.iloc[:,-1:]
cat_col
target_y

     Dept
row1  abc
row2  abe
row3  rbc
row4  hbc

In [60]:
df['new_col']=df.std_id + df.ID
df

      ID  std_id Dept  new_col
row1   1     444  abc      445
row2   2     555  abe      557
row3   3     666  rbc      669
row4   4     333  hbc      337

In [ ]:
df.drop('new_col',axis=1)

      ID  std_id Dept  new_col
row1   1     444  abc      445
row2   2     555  abe      557
row3   3     666  rbc      669
row4   4     333  hbc      337

In [67]:
#axis --> row
df.drop('row2',axis=0)
df.drop(['row2','row3'],axis=0)

      ID  std_id Dept  new_col
row1   1     444  abc      445
row4   4     333  hbc      337

In [ ]:
df.isnull()
df.isnull().sum()

ID         0
std_id     0
Dept       0
new_col    0
dtype: int64

In [72]:
data =[[1,444,'abc'],
       [2,555,'abc'],
       [3,666,'abc'],
       [4,np.nan,'abc']]

df = pd.DataFrame(data,columns=['ID','std_id','Dept'])

In [ ]:
null =df.isnull().sum()
pd.DataFrame(null).T

   ID  std_id  Dept
0   0       1     0

In [76]:
def isNull(df):
   null =df.isnull().sum()
   return pd.DataFrame(null).T

In [77]:
from isnullval import isNull
isNull(df)

   ID  std_id  Dept
0   0       1     0